import { MetroLine } from "./types";


export const metroLines: MetroLine[] = [

  {
    id: 1,
    name: "خط ۱",
    color: "#E53935",

    paths: [

      {
        name: "مسیر تجریش - کهریزک",

        stations: [
          "تجریش",
          "قیطریه",
          "شهید صدر",
          "قلهک",
          "دکتر شریعتی",
          "میرداماد",
          "شهید حقانی",
          "شهید همت",
          "مصلی امام خمینی (ره)",
          "شهید بهشتی",
          "شهید مفتح",
          "شهدای هفتم تیر",
          "طالقانی",
          "دروازه دولت",
          "سعدی",
          "امام خمینی",
          "پانزده خرداد",
          "خیام",
          "میدان محمدیه",
          "شوش",
          "پایانه جنوب",
          "شهید بخارایی",
          "علی‌آباد",
          "جوانمرد قصاب",
          "شهرری",
          "پالایشگاه",
          "شاهد-باقرشهر",
          "حرم امام خمینی",
          "کهریزک",
        ],
      },


      {
        name: "انشعاب پرند",

        stations: [
          "شاهد-باقرشهر",
          "نمایشگاه شهر آفتاب",
          "فرودگاه امام خمینی (ره)",
          "پرند",
        ],
      },

    ],
  },
  {
    id: 2,
    name: "خط ۲",
    color: "#1565C0",

    paths: [

      {
        name: "مسیر صادقیه - فرهنگسرا",

        stations: [
          "تهران (صادقیه)",
          "طرشت",
          "دانشگاه شریف",
          "شادمان",
          "شهید نواب صفوی",
          "میدان حر",
          "دانشگاه امام علی",
          "حسن‌آباد",
          "امام خمینی",
          "ملت",
          "بهارستان",
          "دروازه شمیران",
          "امام حسین",
          "شهید مدنی",
          "سبلان",
          "فدک",
          "جانبازان",
          "سرسبز",
          "دانشگاه علم و صنعت",
          "شهید باقری",
          "تهرانپارس",
          "فرهنگسرا",
        ],
      },

    ],
  },
  {
    id: 3,
    name: "خط ۳",
    color: "#29B6F6",

    paths: [

      {
        name: "مسیر قائم - آزادگان",

        stations: [

          "قائم",
          "شهید محلاتی",
          "اقدسیه",
          "نوبنیاد",
          "حسین‌آباد",
          "میدان هروی",
          "شهید زین‌الدین",
          "خواجه عبدالله انصاری",
          "شهید صیاد شیرازی",
          "شهید قدوسی",
          "سهروردی",
          "شهید بهشتی",
          "میرزای شیرازی",
          "میدان جهاد",
          "میدان ولیعصر (عج)",
          "تئاتر شهر",
          "منیریه",
          "مهدیه",
          "راه‌آهن",
          "جوادیه",
          "زمزم",
          "شهرک شریعتی",
          "عبد‌ل‌آباد",
          "نعمت‌آباد",
          "آزادگان",

        ],
      },

    ],
  },
  {
    id: 4,
    name: "خط ۴",
    color: "#FDD835",

    paths: [

      {
        name: "مسیر شهید کلاهدوز - علامه جعفری",

        stations: [
          "شهید کلاهدوز",
          "نیروی هوایی",
          "نبرد",
          "پیروزی",
          "ابن سینا",
          "میدان شهدا",
          "دروازه شمیران",
          "دروازه دولت",
          "فردوسی",
          "تئاتر شهر",
          "میدان انقلاب اسلامی",
          "توحید",
          "شادمان",
          "دکتر حبیب‌الله",
          "استاد معین",
          "میدان آزادی",
          "بیمه",
          "شهرک اکباتان",
          "ارم سبز",
          "علامه جعفری",
        ],
      },

    ],
  },





  {
    id: 5,
    name: "خط ۵",
    color: "#00897B",

    paths: [

      {
        name: "مسیر صادقیه - گلشهر",

        stations: [
          "تهران (صادقیه)",
          "ارم سبز",
          "ورزشگاه آزادی",
          "چیتگر",
          "ایران خودرو",
          "وردآورد",
          "گرم‌دره",
          "اتمسفر",
          "کرج",
          "محمدشهر",
          "گلشهر",
        ],
      },


      {
        name: "ادامه مسیر هشتگرد",

        stations: [
          "گلشهر",
          "مهستان",
          "هشتگرد",
        ],
      },

    ],
  },






  {
    id: 6,
    name: "خط ۶",
    color: "#8E24AA",

    paths: [

      {
        name: "مسیر دولت‌آباد - کوهسار",

        stations: [

          "شهدای دولت‌آباد",
          "کیانشهر",
          "بعثت",
          "شهید رضایی",
          "امیرکبیر",
          "میدان شهدا",
          "امام حسین",
          "شهدای هفتم تیر",
          "میدان حضرت ولیعصر (عج)",
          "بوستان لاله",
          "کارگر",
          "دانشگاه تربیت مدرس",
          "شهرک آزمایش",
          "مرزداران",
          "یادگار امام",
          "شهید اشرفی اصفهانی",
          "شهید ستاری",
          "شهر زیبا",
          "شهران",
          "شهید آرمان علی‌وردی (کوهسار)",

        ],
      },

    ],
  },








  {
    id: 7,
    name: "خط ۷",
    color: "#7B1FA2",

    paths: [

      {
        name: "مسیر میدان کتاب - ورزشگاه تختی",

        stations: [

          "میدان کتاب",
          "شهید دادمان",
          "میدان صنعت",
          "برج میلاد تهران",
          "بوستان گفتگو",
          "دانشگاه تربیت مدرس",
          "مدافعان سلامت",
          "توحید",
          "شهید نواب صفوی",
          "رودکی",
          "کمیل",
          "بریانک",
          "هلال احمر",
          "مهدیه",
          "میدان محمدیه",
          "مولوی",
          "میدان قیام",
          "شهدای هفده شهریور",
          "چهل تن دولاب",
          "آهنگ",
          "بسیج",
          "ورزشگاه تختی",

        ],
      },

    ],
  },

];