import {
    Calculator,
    History,
    Lightbulb,
    CircleHelp,
} from "lucide-react";


export const calculatorContent = {

    title: "درباره ماشین حساب",

    icon: Calculator,


    items: [


        {
            title: "ماشین حساب چیست؟",

            icon: Calculator,

            content:
                "ماشین حساب ابزاری برای انجام محاسبات ریاضی مانند جمع، تفریق، ضرب، تقسیم و درصد است که باعث افزایش سرعت و دقت در انجام محاسبات روزمره می‌شود."
        },


        {
            title: "تاریخچه ماشین حساب",

            icon: History,

            content:
                "اولین ابزارهای محاسباتی مانند چرتکه هزاران سال قدمت دارند. با پیشرفت فناوری، ماشین حساب‌های مکانیکی و سپس دیجیتال به وجود آمدند."
        },


        {
            title: "کاربردهای ماشین حساب",

            icon: Lightbulb,

            content:
                "از ماشین حساب در امور مالی، آموزش، مهندسی، برنامه نویسی و محاسبات روزانه استفاده می‌شود."
        },


        {
            title: "چگونه استفاده کنیم؟",

            icon: CircleHelp,

            content:
                "اعداد و عملیات موردنظر خود را وارد کنید. همچنین امکان استفاده از صفحه‌کلید و مشاهده تاریخچه محاسبات در این ابزار وجود دارد."
        }


    ]

};